Revit 2027 API
CriticalPathCollector.GetCalculatedPressureDrop Method
 Gets the calculated pressure drop of the network.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetCalculatedPressureDrop()
Public Function GetCalculatedPressureDrop As Double
public:
double GetCalculatedPressureDrop()
member GetCalculatedPressureDrop : unit -> float
Return Value
Double
 The pressure drop value in the internal Revit unit kg/(ft*s^2).
Remarks
 The calculated pressure drop is the total pressure loss value of all analytical segment on the critical path. The value is often used to select the equipment.
See Also
Reference
CriticalPathCollector Class
Autodesk.Revit.DB.Analysis Namespace